bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "His name will be Mini-Me"], ["description", "He is my mini-me"], ["created_at", 2016-12-18 00:17:11 UTC], ["updated_at", 2016-12-18 00:17:11 UTC]]
---
  def create
    creature = Creature.new(creature_params)

    if creature.save